app/Http/Controllers/Admin/Schedules/DailySchedulesController.php

select * from `languages` where not `code` = 'en'
---
    public function __construct()
    {
        $this->languages = Language::whereNot('code', LanguageConst::NOT_REMOVABLE)->get();

select * from `schedule_days` where `status` = 1
select * from `daily_schedules` order by `id` asc limit 10 offset 0
select count(*) as aggregate from `daily_schedules`
---
    public function index()
    {
        $page_title = __("Daily Schedules");
        $languages = $this->languages;
        $days = ScheduleDay::where('status', 1)->get();
        $schedules = DailySchedule::orderBy('id', 'asc')->paginate(10);

select * from `site_sections` where `key` = 'daily-schedule-section' limit 1
---
    public function scheduleSectionUpdate(Request $request)
    {
        $basic_field_name = ['section_title' => "required|string|max:100", 'title' => "required|string|max:100", 'section_icon'   => "required|string|max:100"];

        $slug = Str::slug(SiteSectionConst::DAILY_SCHEDULE_SECTION);
        $section = SiteSections::where("key", $slug)->first();