app/Http/Controllers/User/DashboardController.php

select * from `setup_pages` where `slug` = 'home' limit 1
select * from `basic_settings` limit 1
---
    public function index()
    {
        $page_section = SetupPage::where('slug', 'home')->with(['sections' => function($q){
            $q->where('status',true);
        }])->first();
        if($page_section->status == false) return redirect()->route('index');
        $basic_settings = BasicSettings::first();