app/Http/Helpers/helpers.php

select * from `user_notifications` order by `id` desc limit 4
---
function get_user_notifications()
{
    $notifications = UserNotification::auth()->latest('id')->take(4)->get();

select * from `setup_pages` where `slug` = 'home' limit 1
---
function pageEnable($slug)
{
    $page = SetupPage::where('slug', $slug)->first();