app/Http/Controllers/Frontend/HomeController.php

select * from `site_sections` where `key` = 'daily-schedule-section' limit 1
select * from `setup_pages` where `slug` = 'home' limit 1
---
    public function index(BasicSettingsProvider $basic_settings)
    {
        $page_title = $basic_settings->get()?->site_name . " | " . $basic_settings->get()?->site_title;
        $slug = Str::slug(SiteSectionConst::DAILY_SCHEDULE_SECTION);
        $section = SiteSections::where("key",$slug)->first();

        $page_section = SetupPage::where('slug', 'home')->with(['sections' => function($q){
            $q->where('status',true);
        }])->first();

select * from `setup_pages` where `slug` = 'contact-us' limit 1
---
    public function aboutView()
    {
        $page_section = SetupPage::where('slug', 'about')->with(['sections' => function($q){
            $q->where('status',true);
        }])->first();

select * from `setup_pages` where `slug` = 'team' limit 1
---
    public function contactView()
    {
        $page_section = SetupPage::where('slug', 'contact')->with(['sections' => function($q){
            $q->where('status',true);
        }])->first();

select * from `setup_pages` where `slug` = 'blog' limit 1
---
    public function galleryView()
    {
        $page_section = SetupPage::where('slug', 'gallery')->with(['sections' => function($q){
            $q->where('status',true);
        }])->first();