app/Http/Controllers/Admin/AdminCareController.php

select * from `admin_roles`
select * from `admin_role_permissions`
---
    public function rolePermissionIndex()
    {
        // dd('working');
        $page_title = "Permission Group";
        $roles = AdminRole::get();
        $permissions = AdminRolePermission::get();

select * from `admin_roles`
---
    public function rolePermissionCreate()
    {
        $page_title = "Permission Create";
        $roles = AdminRole::get();

select * from `admin_role_permissions` where `slug` = 'sub-admin' limit 1
select * from `admin_roles`
---
    public function rolePermissionEdit($slug){
        $page_title             = "Permission Edit";
        $assign_permissions     = AdminRolePermission::with('hasPermissions')->where('slug',$slug)->first();
        if(!$assign_permissions) return back()->with(['error' => ['Sorry! Permission not found.']]);
        $roles                  = AdminRole::get();