app/Http/Controllers/Admin/SetupPagesController.php

select * from `setup_pages` where `type` = 'setup-page'
---
    public function index()
    {
        $page_title = __("Setup Pages");
        $type = Str::slug(GlobalConst::SETUP_PAGE);
        $setup_pages = SetupPage::where('type', $type)->get();

select * from `setup_pages` where `slug` = 'blog' limit 1
select * from `site_sections` where `site_sections`.`id` in (3, 4, 5, 6, 7, 8, 10, 11, 12)
select * from `site_sections` where `key` not in ('announcement-section', 'banner-section', 'about-section', 'testimonial-section', 'video-section', 'gallery-section', 'team-section', 'contact-section', 'daily-schedule-section') and `key` not in ('site_cookie', 'auth-section', 'footer-section')
select * from `site_sections` where `key` not in ('site_cookie', 'auth-section', 'footer-section')
---
    public function details($slug){
        $page_title         = __("Setup Page Details");
        $setup_page         = SetupPage::with('sections.section')->where('slug',$slug)->first();

        if(!$setup_page) return back()->with(['error' => ['Sorry! Setup page not found.']]);

        $excludedKeys = array_map('strtolower', array_map('trim', SiteSectionConst::notDisplaySections()));

        if ($setup_page && $setup_page->sections->isNotEmpty()) {
            $ordered_sections = collect();

            foreach ($setup_page->sections as $assigned) {
                if ($assigned->section) {
                    $ordered_sections->push($assigned->section);
                }
            }

            $existing_keys = $ordered_sections->pluck('key')->map(fn($k) => strtolower(trim($k)))->toArray();

            $remaining_sections = SiteSections::whereNotIn('key', $existing_keys)
                ->whereNotIn('key', $excludedKeys)
                ->get();

            $site_sections = $ordered_sections
                ->reject(fn($section) => in_array(strtolower(trim($section->key)), $excludedKeys))
                ->merge($remaining_sections);

        } else {
            $site_sections = SiteSections::whereNotIn('key', $excludedKeys)->get();

select * from `setup_pages` where `slug` = 'about' limit 1
select * from `site_sections` where `key` = 'about-section' limit 1
select * from `setup_page_has_sections` where (`setup_page_id` = 19 and `site_section_id` = 4) limit 1
---
    public function updateSection(Request $request,$slug){
        $setup_page = SetupPage::where('slug', $slug)->first();
        if (!$setup_page) {
            return back()->with(['error' => ['Sorry! Setup page not found.']]);
        }

        $validator = Validator::make($request->all(), [
            'sections'   => 'required|array',
            'sections.*' => 'required|string',
            'status'     => 'required|array',
            'status.*'   => 'required|in:0,1',
        ]);

        if ($validator->fails()) {
            return back()->withErrors($validator)->withInput($request->all());
        }

        $validated = $validator->validated();

        foreach ($validated['sections'] ?? [] as $index => $section_key) {
            $section = SiteSections::where('key', $section_key)->first();
            if (!$section) {
                continue;
            }

            $position               = $index + 1;
            $status                 = $validated['status'][$index] ?? 1;

            $existing               = SetupPageHasSection::where([
                'setup_page_id'     => $setup_page->id,
                'site_section_id'   => $section->id,
            ])->first();

insert into `setup_page_has_sections` (`setup_page_id`, `site_section_id`, `position`, `status`, `updated_at`, `created_at`) values (23, 10, 1, '1', '2025-09-11 12:03:28', '2025-09-11 12:03:28')
---
                    'status'   => $status,
                ]);
            }else{
                SetupPageHasSection::create([
                    'setup_page_id'   => $setup_page->id,
                    'site_section_id' => $section->id,
                    'position'        => $position,
                    'status'          => $status,
                ]);