app/Http/Controllers/Admin/UserCareController.php

    public function index()
    {
        $page_title = __("All Users");
        $users = User::orderBy('id', 'desc')->paginate(12);
---
select * from `users` order by `id` desc limit 12 offset 0
select count(*) as aggregate from `users`

    public function store(Request $request){
        $basic_settings         = BasicSettings::first();
        $password_rule = "required|string|min:6";
        if($basic_settings->secure_password) {
            $password_rule = ["required",Password::min(8)->letters()->mixedCase()->numbers()->symbols()->uncompromised()];
        }
        $validator      = Validator::make($request->all(),[
            'firstname'         => 'required|string',
            'lastname'          => 'required|string',
            'email'             => 'required|email',
            'country'      => "required|string|max:50",
            'password'     => $password_rule,
            'email_verified'    => 'nullable',
            'kyc_verified'      => 'nullable'
        ]);
        if($validator->fails()){
            return back()->withErrors($validator)->withInput($request->all());
        }
        $validated              = $validator->validate();

        $user_name              = make_username(Str::slug($validated['firstname']),Str::slug($validated['lastname']),'users');

        $validated['username']      = $user_name;
        $validated['password']      = Hash::make($validated['password']);
        $validated['status']        = true;
        $validated['address']  = [
            'country'       => $validated['country'] ?? "",
        ];
        try{
            $user = User::create($validated);
---
select * from `basic_settings` limit 1
insert into `users` (`firstname`, `lastname`, `email`, `password`, `email_verified`, `username`, `status`, `address`, `updated_at`, `created_at`) values ('Lawrence', 'Strong', 'dofaki@mailinator.com', '$2y$10$5KZZPeiY9FyNx0jb/bsS7uaZYki5BmfI7BFsvWOFZcRs6nKdIWVjO', '1', 'lawrence', 1, '{\"country\":\"Mayotte\"}', '2025-09-11 18:08:09', '2025-09-11 18:08:09')