app/Http/Controllers/Admin/WebSettingsController.php

select * from `basic_settings` limit 1
---
    public function basicSettings()
    {
        $page_title =  __("Basic Settings");
        $basic_settings   = BasicSettings::first();